/*
'number' + 3 + 3
//тут буде "number33" - конкатенації строк
null + 3
//тут буде "3" - null = 0, тому 0 +3 = 3
5 && "qwerty"
//тут буде qwerty оба значення тру тому повертає другий тру(qwerty)
+'40' + +'2' + "hillel"
// тут буде 42hillel - зліва на право спочатку дві стрингі у намбер та скласти 40+2=42 потім конкатенації строк
'10' - 5 === 6)
// тут буде false - 10-5=5  5===6=фолз
true + false
//тут буде 1 - тру=1 + фолз=0
'4px' - 3
//тут буде NaN - '4px' НЕ можливо перетворити в намбер
'4' - 3
//тут буде 1 - стрінга перетворюється в намбер 4-3=1
'6' + 3 ** 0
//тут буде 61 - спочатку 3 у 0 степені буде 1, потім конкатенації строк
12 / '6'
//тут буде 2 - стрінга перетворюється  в намбер
'10' + (5 === 6)
//тут буде 10false - з права наліво (5 === 6) це фолз а далі конкатенації строк
null == ''
//тут буде false так як іх порівняти взагалі не можливо
3 ** (9 / 3)
//буде 27 - з права наліво спочатку 9/3=3 потім 3*3*3=27
!!'false' == !!'true'
//тут буде true - !! все де є данні привод до тру того !!'false'= true true == true= true
0 || '0' && 1
    //тут буде 1 - спочатку '0' && 1 поверне 1 потім 0 || 1 тут поверне 1
    (+null == false) < 1
////тут буде false - зліва на право +null=0 0==false=true true<1 = 1<1=false
false && true || true
//тут буде true - так как false і&& true=true та true чи|| true = тру
false && (false || true)
    //тут буде false - з права на ліво спочатку false || true= true потім false &&  true = фолз
    (+null == false) < 1 ** 5
//тут буде false - зліва на право +null=0 0==false=true true<1**5 тут вже з права наліво 1*1*1*1*1=1 і того true=1 залишається 1<1 =false
*/